#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.eks.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0be9f882f22799ca2]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/MyFirstCluster/cluster]
module.eks.aws_sns_topic.alertmanager: Refreshing state... [id=arn:aws:sns:ap-northeast-1:865518846931:MyFirstCluster_alertmanager_topic]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-cluster-20220129060345054100000001]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=MyFirstCluster-cluster-20220129060345054100000001-20220129060345888500000004]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=MyFirstCluster-cluster-20220129060345054100000001-20220129060345891900000007]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group-20220129060345884600000003]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group-20220129060345890700000006]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group-20220129060345982200000009]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group-2022012906034598640000000a]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group-20220129060345981700000008]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group-20220129060345889900000005]
module.eks.aws_iam_policy.alertmanager_subscribable: Refreshing state... [id=arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-subscribable-policy]
module.eks.aws_iam_policy.alertmanager_publishable: Refreshing state... [id=arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy]
module.eks.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a364be80932c73ff]
module.eks.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-099d8f8f29ca320ae]
module.eks.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b352c6ec07bd6caf]
module.eks.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e277b5e645e45ff3]
module.eks.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05713a0cee28d43d9]
module.eks.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a364be80932c73ff1080289494]
module.eks.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d221d2cff6984462]
module.eks.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00e061b9b6d784cae]
module.eks.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05a2ffc6a0bfc69a1]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=MyFirstCluster]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A]
module.eks.aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::865518846931:policy/KarpenterControllerPolicy-refresh]
module.eks.module.iam_assumable_role_alertmanager.aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-alertmanager20220129063446995800000001]
module.eks.module.iam_assumable_role_cluster_autoscaler.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler20220129063446997500000002]
module.eks.module.iam_assumable_role_cluster_autoscaler.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cluster-autoscaler20220129063446997500000002-20220129063447956700000003]
module.eks.module.iam_assumable_role_alertmanager.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=MyFirstCluster-alertmanager20220129063446995800000001-20220129063448014900000004]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                        = "MyFirstCluster"
        name                      = "MyFirstCluster"
      + tags                      = {}
        # (11 unchanged attributes hidden)



      ~ vpc_config {
          ~ security_group_ids        = [
              - "",
            ]
            # (6 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.eks.module.iam_assumable_role_alertmanager.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "MyFirstCluster-alertmanager20220129063446995800000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy",
        ]
        name                  = "MyFirstCluster-alertmanager20220129063446995800000001"
        tags                  = {
            "ClusterName" = "MyFirstCluster"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.iam_assumable_role_cluster_autoscaler.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "cluster-autoscaler20220129063446997500000002"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::865518846931:policy/KarpenterControllerPolicy-refresh",
        ]
        name                  = "cluster-autoscaler20220129063446997500000002"
        tags                  = {
            "ClusterName" = "MyFirstCluster"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "MyFirstCluster" -> (known after apply)
      ~ name  = "MyFirstCluster" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.data.aws_iam_policy_document.cluster_autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler"  {
      ~ id      = "2744865476" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeLaunchTemplateVersions",
                          - "autoscaling:DescribeTags",
                          - "autoscaling:DescribeLaunchConfigurations",
                          - "autoscaling:DescribeAutoScalingInstances",
                          - "autoscaling:DescribeAutoScalingGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "clusterAutoscalerAll"
                    },
                  - {
                      - Action    = [
                          - "autoscaling:UpdateAutoScalingGroup",
                          - "autoscaling:TerminateInstanceInAutoScalingGroup",
                          - "autoscaling:SetDesiredCapacity",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - autoscaling:ResourceTag/k8s.io/cluster-autoscaler/MyFirstCluster = "owned"
                              - autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled        = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "clusterAutoscalerOwn"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "owned",
                ] -> null
              - variable = "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/MyFirstCluster" -> null
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = (known after apply)
            }
            # (1 unchanged block hidden)
        }
    }

  # module.eks.aws_iam_policy.cluster_autoscaler[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_autoscaler" {
        id        = "arn:aws:iam::865518846931:policy/KarpenterControllerPolicy-refresh"
        name      = "KarpenterControllerPolicy-refresh"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeLaunchTemplateVersions",
                          - "autoscaling:DescribeTags",
                          - "autoscaling:DescribeLaunchConfigurations",
                          - "autoscaling:DescribeAutoScalingInstances",
                          - "autoscaling:DescribeAutoScalingGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "clusterAutoscalerAll"
                    },
                  - {
                      - Action    = [
                          - "autoscaling:UpdateAutoScalingGroup",
                          - "autoscaling:TerminateInstanceInAutoScalingGroup",
                          - "autoscaling:SetDesiredCapacity",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - autoscaling:ResourceTag/k8s.io/cluster-autoscaler/MyFirstCluster = "owned"
                              - autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled        = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "clusterAutoscalerOwn"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "ClusterName" = "MyFirstCluster"
        }
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this"  {
      ~ certificates = [
          - {
              - is_ca                = true
              - issuer               = "OU=Starfield Class 2 Certification Authority,O=Starfield Technologies\\, Inc.,C=US"
              - not_after            = "2034-06-28T17:39:16Z"
              - not_before           = "2009-09-02T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "12037640545166866303"
              - sha1_fingerprint     = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - version              = 3
            },
          - {
              - is_ca                = true
              - issuer               = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - not_after            = "2037-12-31T01:00:00Z"
              - not_before           = "2015-05-25T12:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918191876577076464031512351042010504348870"
              - sha1_fingerprint     = "06b25927c42a721631c1efd9431e648fa62e1e39"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - is_ca                = true
              - issuer               = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - not_after            = "2025-10-19T00:00:00Z"
              - not_before           = "2015-10-22T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918209630989264145272943054026349679957517"
              - sha1_fingerprint     = "917e732d330f9a12404f73d8bea36948b929dffc"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon,OU=Server CA 1B,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - is_ca                = false
              - issuer               = "CN=Amazon,OU=Server CA 1B,O=Amazon,C=US"
              - not_after            = "2022-07-12T23:59:59Z"
              - not_before           = "2021-06-13T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "9157200613194073099208944830118320123"
              - sha1_fingerprint     = "579a7c336f718637adbb9147ef7ca643341053b6"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=oidc.eks.ap-northeast-1.amazonaws.com"
              - version              = 3
            },
        ] -> (known after apply)
      ~ id           = "2022-01-29 06:34:47.571513781 +0000 UTC" -> (known after apply)
      ~ url          = "https://oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A" -> (known after apply)
      - verify_chain = true -> null
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-northeast-1:865518846931:cluster/MyFirstCluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ERXlPVEEyTXpBek9Gb1hEVE15TURFeU56QTJNekF6T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTTh0CktHWmQrVGFLNEtnSWFnMEp2VzRaZy9oeUpIa0YxbzA1YlZCRFRkVU9nVjFaem9qVVpDUVI3YVFKb2dsV1Zvd1AKay9KWEVSUVZxcEdQWGJZeDJuOHVPak1seG5ZeHdXdnJNZDRSMVQxUkVicUdKK3c0MWg0dDk3VVdZSk9mbzlSaworNkR6U3I4d3hGR1QyM0xyUFB2akN0Y2dPQm1leFUyQ1liUE5rbURDanVxcGRGRktHODdvZVZVQitHdHFpSk9SCnhNY2RNVnlDY0dnVlV4MXpSK0JGKzNhK3ZxamNlOGlMVXJ5cTgwU1grNjA4a2xpWjFaSnhESW5zYnZHRGxYcDkKazdhTzdlb2E2WWIyZ011VWgxZFRkanhnSFFuQUxaZGhoeFRLaTRCRGpzL05QR2pMQmhBblJZUSt0VTJkYy80YQpvRHVCYnBuUHZtdG53S0plVE8wQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZERW04QlZTU0huTTI2NlFvT2lkMUl6ZVRFTWpNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDeTFMMmVDVzZyTkxOWWliM1MvQlR4aEVsN0xpTktWNENmdmhQN0kzVW9LMHpidmxqaApORjhhQUhDZ0g5ODQwLzdSNXJ5OUUybDlLQStoMW90NzFJcWNuMjF4V3Z2aGl0d1ZQY1JBWWdPUE82amVKWHU3CmY1VEgxaXhwdXdlbXd3cXZaSm1FRWViQ2ZHRUFQdCtxYlFNVGpEVGM5REFabzRXTzBOSTR3Ty9uTzJsQ28wVzMKcGpjRlpxakdURnBmdjB5czhubVJhd01ReUhXd0JjbzZtZXFhMDJWQ3lCSUY3dU81QXVoanRKZ0FNWVNVQVQxSgpTS0IrZkY3dGwwRW15akZNd1NvOWlSVm9VRmNtNTB0cG4zRGdFbEs1NmZ1d2twYm5TSGI1UjhwdERVdnNkSURsCk9QM2F4SHBPWjlnOE5PNjhHY0MxUlJVWGM4TnpIYkRCTHdiSgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-01-29 06:23:41.355 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://DE6CAC4718F471E8CAFA125D7868EE5A.gr7.ap-northeast-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "MyFirstCluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "MyFirstCluster"
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-050c58d56810cc54a" -> (known after apply)
          ~ security_group_ids        = [ # forces replacement
              + "",
            ]
          ~ vpc_id                    = "vpc-0be9f882f22799ca2" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A" -> (known after apply)
      ~ id              = "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A" -> (known after apply)
        tags            = {
            "Name" = "MyFirstCluster-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["medium"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "MyFirstCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "MyFirstCluster-medium"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::865518846931:role/MyFirstCluster-medium-eks-node-group"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05713a0cee28d43d9",
          + "subnet-0b352c6ec07bd6caf",
          + "subnet-0e277b5e645e45ff3",
        ]
      + tags                   = {
          + "Name" = "MyFirstCluster-medium"
        }
      + tags_all               = {
          + "Name" = "MyFirstCluster-medium"
        }
      + version                = "1.21"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 0
          + max_size     = 1
          + min_size     = 0
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["medium"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for medium EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "medium-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "MyFirstCluster-medium"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "MyFirstCluster-medium"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "MyFirstCluster-medium"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "MyFirstCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "r5.large",
          + "r5a.large",
          + "r5ad.large",
          + "r5b.large",
          + "r5n.large",
          + "r4.large",
          + "z1d.large",
        ]
      + node_group_name        = "MyFirstCluster-memory_optimized_large"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::865518846931:role/MyFirstCluster-memory_optimized_large-eks-node-group"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05713a0cee28d43d9",
          + "subnet-0b352c6ec07bd6caf",
          + "subnet-0e277b5e645e45ff3",
        ]
      + tags                   = {
          + "Name" = "MyFirstCluster-memory_optimized_large"
        }
      + tags_all               = {
          + "Name" = "MyFirstCluster-memory_optimized_large"
        }
      + version                = "1.21"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 0
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for memory_optimized_large EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "memory_optimized_large-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "MyFirstCluster-memory_optimized_large"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "MyFirstCluster-memory_optimized_large"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "MyFirstCluster-memory_optimized_large"
            }
        }
    }

  # module.eks.module.iam_assumable_role_alertmanager.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      ~ id      = "3857941707" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:sub = "system:serviceaccount:monitoring:alertmanager-sa"
                            }
                          - StringLike   = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:aud = "sts.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "sts:AssumeRoleWithWebIdentity",
            ] -> (known after apply)
          ~ effect        = "Allow" -> (known after apply)
          ~ not_actions   = [] -> (known after apply)
          ~ not_resources = [] -> (known after apply)
          ~ resources     = [] -> (known after apply)
          + sid           = (known after apply)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "system:serviceaccount:monitoring:alertmanager-sa",
                ] -> null
              - variable = "oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:sub" -> null
            }
          - condition {
              - test     = "StringLike" -> null
              - values   = [
                  - "sts.amazonaws.com",
                ] -> null
              - variable = "oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:aud" -> null
            }
          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + not_principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
          - principals {
              - identifiers = [
                  - "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A",
                ] -> null
              - type        = "Federated" -> null
            }
        }
    }

  # module.eks.module.iam_assumable_role_alertmanager.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:sub = "system:serviceaccount:monitoring:alertmanager-sa"
                            }
                          - StringLike   = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:aud = "sts.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "MyFirstCluster-alertmanager20220129063446995800000001"
        name                  = "MyFirstCluster-alertmanager20220129063446995800000001"
        tags                  = {
            "ClusterName" = "MyFirstCluster"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.iam_assumable_role_cluster_autoscaler.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      ~ id      = "2880738892" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:sub = "system:serviceaccount:kube-system:cluster-autoscaler-aws"
                            }
                          - StringLike   = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:aud = "sts.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "sts:AssumeRoleWithWebIdentity",
            ] -> (known after apply)
          ~ effect        = "Allow" -> (known after apply)
          ~ not_actions   = [] -> (known after apply)
          ~ not_resources = [] -> (known after apply)
          ~ resources     = [] -> (known after apply)
          + sid           = (known after apply)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "system:serviceaccount:kube-system:cluster-autoscaler-aws",
                ] -> null
              - variable = "oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:sub" -> null
            }
          - condition {
              - test     = "StringLike" -> null
              - values   = [
                  - "sts.amazonaws.com",
                ] -> null
              - variable = "oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:aud" -> null
            }
          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + not_principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
          - principals {
              - identifiers = [
                  - "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A",
                ] -> null
              - type        = "Federated" -> null
            }
        }
    }

  # module.eks.module.iam_assumable_role_cluster_autoscaler.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:sub = "system:serviceaccount:kube-system:cluster-autoscaler-aws"
                            }
                          - StringLike   = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A:aud = "sts.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::865518846931:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/DE6CAC4718F471E8CAFA125D7868EE5A"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cluster-autoscaler20220129063446997500000002"
        name                  = "cluster-autoscaler20220129063446997500000002"
        tags                  = {
            "ClusterName" = "MyFirstCluster"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_id = "MyFirstCluster" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @shogotsuneto, Action: `pull_request`*